In [1]:
import pandas as pd
import numpy as np

#### __10. Aggregate DataFrame data using custom operations for different columns using the aggregate function.__

In [2]:
df = pd.read_csv("../exercises/data/Emp_data.csv")

In [3]:
df.aggregate({'Salary' : ['sum', 'max', 'mean'], 'Weight in Kgs': ['sum', 'max', 'mean'] })

           Salary  Weight in Kgs
sum   11973809.00        5808.00
max     197537.00          90.00
mean    119738.09          58.08

#### __11. Use the apply function to categorize numeric column values into bins such as 'Low', 'Medium', and 'High'.__

In [4]:
df

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60,13.68,168251,Denver
1,940761,Brenda,47.02,60,9.01,51063,Stonewall
2,428945,Joe,54.15,68,0.98,50155,Michigantown
3,408351,Diane,39.67,51,18.30,180294,Hydetown
4,193819,Benjamin,40.31,58,4.01,117642,Fremont
...,...,...,...,...,...,...,...
95,639892,Jose,22.82,89,1.05,129774,Biloxi
96,704709,Harold,32.61,77,5.93,156194,Carol Stream
97,461593,Nicole,52.66,60,28.53,95673,Detroit
98,392491,Theresa,29.60,57,6.99,51015,Mc Grath
99,495141,Tammy,38.38,55,2.26,93650,Alma

In [5]:
df.insert(4, 'Weight_category', df['Weight in Kgs'].apply(lambda x: np.where(x >= 80, 'High', np.where(x > 50, "Medium", "Low"))))
df.head()

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Weight_category,Age in Company,Salary,City
0,677509,Lois,36.36,60,Medium,13.68,168251,Denver
1,940761,Brenda,47.02,60,Medium,9.01,51063,Stonewall
2,428945,Joe,54.15,68,Medium,0.98,50155,Michigantown
3,408351,Diane,39.67,51,Medium,18.30,180294,Hydetown
4,193819,Benjamin,40.31,58,Medium,4.01,117642,Fremont

#### __16. Student Performance Analysis: Create a DataFrame with columns: StudentID, StudentName, Math, Science, English (minimum 5 entries).__

- a. Identify the student with the highest average score and display their name and average score.
- b. Calculate the average Math score and list students scoring above this average.
- c. Determine which subject had the highest overall average score.

In [6]:
col = ["StudentID", "StudentName", "Math", "Science", "English"]

df = pd.DataFrame(columns=col)
df.StudentID = range(1,6)
df.StudentName = ["test1", "test2", "test3", "test4", "test5"]
df.Math = np.random.randint(35,95, 5)
df.Science = np.random.randint(35,78, 5)
df.English = np.random.randint(35,70, 5)

In [7]:
df

   StudentID StudentName  Math  Science  English
0          1       test1    86       72       69
1          2       test2    62       75       42
2          3       test3    88       73       41
3          4       test4    49       65       44
4          5       test5    67       43       63

__a. Identify the student with the highest average score and display their name and average score.__

In [8]:
df["average"] = df[["Math","Science", "English"]].mean(axis=1).round(decimals=2)
df

   StudentID StudentName  Math  Science  English  average
0          1       test1    86       72       69    75.67
1          2       test2    62       75       42    59.67
2          3       test3    88       73       41    67.33
3          4       test4    49       65       44    52.67
4          5       test5    67       43       63    57.67

In [9]:
df[df.average == df.average.max()][["StudentName", "average"]]

  StudentName  average
0       test1    75.67

__b. Calculate the average Math score and list students scoring above this__

In [10]:
np.where(df["Math"]>df.Math.mean(), df.StudentName, df.Math)

array(['test1', 62, 'test3', 49, 67], dtype=object)

__c. Determine which subject had the highest overall average score.__

In [11]:
if df['Math'].mean() > df['Science'].mean() and df['Math'].mean() > df['English'].mean():
    print("Math")
elif df['Science'].mean() > df['Math'].mean() and df['Science'].mean() > df['English'].mean():
    print("Science")
else:
    print("english")

Math